// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

/* 
Задача: Написать программу, которая из имеющегося массива строк формирует массив из строк, длина 
которых меныше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать 
на стирте выполнения алгоритма, При решении не рекомендуется пользоваться коллекциями, 
пучше обойтись исключительно массивами.
 */